Terraform plan for __staging__
<details>
  <summary>Plan: 9 to add, 1 to change, 9 to destroy. Changes to Outputs.</summary>

```hcl
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_route53_zone.zone[0] must be replaced
-/+ resource "aws_route53_zone" "zone" {
      + force_destroy = false
      ~ id            = "********************" -> (known after apply)
      ~ name          = "ssb-staging.datagov.us." -> "ssb-staging.data.gov" # forces replacement
      ~ name_servers  = [
          - "ns-1148.awsdns-15.org",
          - "ns-1937.awsdns-50.co.uk",
          - "ns-377.awsdns-47.com",
          - "ns-965.awsdns-56.net",
        ] -> (known after apply)
      - tags          = {} -> null
      + vpc_id        = (known after apply)
      + vpc_region    = (known after apply)
      ~ zone_id       = "********************" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # cloudfoundry_service_instance.k8s_cluster will be updated in-place
  ~ resource "cloudfoundry_service_instance" "k8s_cluster" {
        id                             = "57aea10e-958c-4ad5-80bc-cd6f3ac27233"
        name                           = "ssb-k8s"
      ~ service_plan                   = "36000c96-9efc-4143-97aa-6f1cfbe9a7ba" -> (known after apply)
        tags                           = [
            "k8s",
        ]
        # (4 unchanged attributes hidden)

      ~ timeouts {
          ~ create = "30m" -> "40m"
            # (1 unchanged attribute hidden)
        }
    }

  # module.broker_aws.data.archive_file.app_zip will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "app_zip"  {
      ~ id                  = "****************************************" -> (known after apply)
      ~ output_base64sha256 = "jDnsF3nzE8ih8Cp/CFLPXfftHJwdOtSBbIQN1u5Regs=" -> (known after apply)
      ~ output_md5          = "75c7d8f95d99bd2ffeca2218126c51a5" -> (known after apply)
      ~ output_sha          = "a3522bcca749f305f1ea129752e5898788880b73" -> (known after apply)
      ~ output_size         = 136879275 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.broker_aws.data.cloudfoundry_domain.apps will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_domain" "apps"  {
      ~ domain     = "cloud.gov" -> (known after apply)
      ~ id         = "************************************" -> (known after apply)
      ~ internal   = false -> (known after apply)
      ~ name       = "app.cloud.gov" -> (known after apply)
      + org        = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.broker_aws.data.cloudfoundry_service.rds will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_service" "rds"  {
      ~ id                  = "************************************" -> (known after apply)
        name                = "aws-rds"
      ~ service_broker_name = "aws-broker" -> (known after apply)
      ~ service_plans       = {
          - "large-gp-mysql"            = "399ebbb8-ab37-4883-bb7b-0467e66aa8f0"
          - "large-gp-mysql-redundant"  = "3cfd191c-809a-40b1-93c7-37f2f07ec151"
          - "large-gp-psql"             = "639ae8c5-7605-476d-ae55-cfc58f46c6d7"
          - "large-gp-psql-redundant"   = "7eab29c9-e690-4c98-9f78-07cde05b2904"
          - "medium-gp-mysql"           = "f2d7b4af-16e5-4504-8cf9-c1be5d3c81bc"
          - "medium-gp-mysql-redundant" = "f6e176ec-d093-42f7-80e8-2bbacbab450d"
          - "medium-gp-psql"            = "815c6069-289a-4444-ba99-40f0fa03a8f5"
          - "medium-gp-psql-redundant"  = "c1ddc2d6-983b-4ced-9995-064d9dde07aa"
          - "medium-mysql"              = "adf004d9-54b6-40e8-ae6a-56ee985a646c"
          - "medium-mysql-redundant"    = "8bfe6ea3-d8b1-4495-8b4c-5aba9c529f4c"
          - "medium-oracle-se2"         = "601b6c2b-2bac-42a0-84c4-4cb841c34deb"
          - "medium-psql"               = "d8af8c96-8cfd-455f-8660-35a029fec110"
          - "medium-psql-redundant"     = "2fb989d0-4097-4726-9877-88c44fa7a622"
          - "micro-psql"                = "5ed9f319-4c75-4851-9885-598a96b7febc"
          - "micro-psql-redundant"      = "ad7461b3-cb73-4859-a660-477993f85f6f"
          - "shared-mysql"              = "3a8e624f-ba5a-4435-8fa4-ee955b103bae"
          - "shared-psql"               = "64a259ed-01ab-4cdb-ace3-14fc7bde4ab6"
          - "small-mysql"               = "88663dbc-92c9-4b40-9f07-fb4788436fc5"
          - "small-mysql-redundant"     = "4b9e5bb1-d0d3-4c24-8542-e377cbb85aed"
          - "small-psql"                = "903c65ce-6c2b-420f-ad7d-a94ac4d52e93"
          - "small-psql-redundant"      = "731eb930-81ea-4a03-82f2-a187d8339d14"
          - "xlarge-gp-mysql"           = "1f44135c-64a8-44fc-bc61-539f126cdb78"
          - "xlarge-gp-mysql-redundant" = "2ed298b8-a7b5-400a-b2f1-c8198423c861"
          - "xlarge-gp-psql"            = "0fd6a750-0860-4c48-a5ea-fdce04500e23"
          - "xlarge-gp-psql-redundant"  = "58b899e8-eb36-441f-b406-d2f5b1e49c00"
        } -> (known after apply)
    }

  # module.broker_aws.data.cloudfoundry_space.broker_space will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_space" "broker_space"  {
      - annotations = {} -> null
      ~ id          = "************************************" -> (known after apply)
      - labels      = {} -> null
        name        = "management-staging"
      ~ org         = "90047c5d-337f-4802-bd48-2149a4265040" -> (known after apply)
      + quota       = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.broker_aws.data.cloudfoundry_space.spaces["gsa-datagov/management-staging"] will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_space" "spaces"  {
      - annotations = {} -> null
      ~ id          = "************************************" -> (known after apply)
      - labels      = {} -> null
        name        = "management-staging"
      ~ org         = "90047c5d-337f-4802-bd48-2149a4265040" -> (known after apply)
      + quota       = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.broker_aws.cloudfoundry_app.ssb must be replaced
-/+ resource "cloudfoundry_app" "ssb" {
      ~ environment                = (sensitive value)
      + health_check_http_endpoint = (known after apply)
      ~ health_check_timeout       = 0 -> (known after apply)
      ~ id                         = "************************************" -> (known after apply)
      ~ id_bg                      = "************************************" -> (known after apply)
        name                       = "ssb-aws"
      ~ ports                      = [
          - 8080,
        ] -> (known after apply)
      ~ source_code_hash           = "jDnsF3nzE8ih8Cp/CFLPXfftHJwdOtSBbIQN1u5Regs=" -> (known after apply)
      ~ space                      = "5edc803e-3376-4788-b72c-a152f11925b0" -> (known after apply) # forces replacement
      ~ stack                      = "ad34309f-ab24-4c3d-9ad1-eb0da8378bd4" -> (known after apply)
        # (11 unchanged attributes hidden)

      - routes {
          - port  = 8080 -> null
          - route = "d0db6adf-8d2f-4e43-bdce-3ea8509f5ec2" -> null
        }
      + routes {
          + port  = (known after apply)
          + route = (known after apply)
        }

      ~ service_binding {
          - params           = (sensitive value)
          ~ service_instance = "b909e976-1ddb-4de4-af9a-825896830f33" -> (known after apply)
        }
    }

  # module.broker_aws.cloudfoundry_route.ssb_uri must be replaced
-/+ resource "cloudfoundry_route" "ssb_uri" {
      ~ domain   = "50ba3f69-cd54-4963-9172-14f3334b479e" -> (known after apply) # forces replacement
      ~ endpoint = "ssb-aws-gsa-datagov-management-staging.app.cloud.gov" -> (known after apply)
      ~ id       = "************************************" -> (known after apply)
      + port     = (known after apply)
      ~ space    = "5edc803e-3376-4788-b72c-a152f11925b0" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.broker_aws.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/management-staging"] must be replaced
-/+ resource "cloudfoundry_service_broker" "space_scoped_broker" {
      ~ catalog_hash                     = "53HUIGos3LnoL6VoQubUuNGmNJw=" -> (known after apply)
      ~ id                               = "************************************" -> (known after apply)
        name                             = "ssb-aws-gsa-datagov-management-staging"
      ~ service_plans                    = {
          - "csb-aws-dynamodb/ondemand"     = "a65d0c9d-cd2f-4e2b-a049-cbbb16cff7fa"
          - "csb-aws-dynamodb/provisioned"  = "de5b2baf-4f32-4717-84c4-abb39aca1ebd"
          - "csb-aws-mysql/large"           = "4fb83bbf-d8fc-422d-9c01-6878ec456950"
          - "csb-aws-mysql/medium"          = "527ab5ee-7120-4262-812b-edbc3c6fe9ed"
          - "csb-aws-mysql/small"           = "78c7e613-2cb1-47ea-91bc-fcd3fb38183d"
          - "csb-aws-postgresql/large"      = "4ad03cdd-1880-4c18-8615-1941f47b9774"
          - "csb-aws-postgresql/medium"     = "065ea746-d4e4-408c-84e0-8f6c37be2ee9"
          - "csb-aws-postgresql/small"      = "db0b5bad-4f2a-4f9c-942f-817a32059c89"
          - "csb-aws-postgresql/subsume"    = "36e0eac7-7dfc-4f7d-b481-a8935edaf7d9"
          - "csb-aws-redis/large"           = "0a22bef9-b7c6-4dfd-bad0-2a1f504b4b7d"
          - "csb-aws-redis/large-ha"        = "7cfc3411-4eb5-4284-a68c-7960cc18fc8a"
          - "csb-aws-redis/medium"          = "2b9ad3ab-4f23-4a84-a478-1e6545b77c1c"
          - "csb-aws-redis/medium-ha"       = "bdd9c4b8-4783-486a-adba-fd66bf8cfe5c"
          - "csb-aws-redis/small"           = "6fdeb3ec-65a1-4f02-9ffe-beae4a4a59c1"
          - "csb-aws-redis/small-ha"        = "ed9f9022-858b-4d64-9361-a1e3f0b6b6af"
          - "csb-aws-s3-bucket/private"     = "79cf6703-1830-4a00-882a-08caf355268c"
          - "csb-aws-s3-bucket/public-read" = "e445add2-cb8a-4ada-871a-71a795ded743"
        } -> (known after apply)
      ~ services                         = {
          - "csb-aws-dynamodb"   = "9a5f8a32-f05c-407f-9708-b75e6f11a43a"
          - "csb-aws-mysql"      = "7c6c4db2-026a-42c1-a453-ac0fd1c39376"
          - "csb-aws-postgresql" = "70c7cbd9-1f4c-4b08-a75c-767e3b49f1b7"
          - "csb-aws-redis"      = "7cca3d63-0693-446b-b4e3-4d846100bc5c"
          - "csb-aws-s3-bucket"  = "9b4de99c-e039-4542-b40f-0da14a436e32"
        } -> (known after apply)
      ~ space                            = "5edc803e-3376-4788-b72c-a152f11925b0" -> (known after apply) # forces replacement
      ~ url                              = "https://ssb-aws-gsa-datagov-management-staging.app.cloud.gov" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.broker_aws.cloudfoundry_service_instance.db must be replaced
-/+ resource "cloudfoundry_service_instance" "db" {
      ~ id                             = "************************************" -> (known after apply)
        name                           = "ssb-aws-db"
      ~ service_plan                   = "3a8e624f-ba5a-4435-8fa4-ee955b103bae" -> (known after apply)
      ~ space                          = "5edc803e-3376-4788-b72c-a152f11925b0" -> (known after apply) # forces replacement
        tags                           = [
            "mysql",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.broker_eks.data.archive_file.app_zip will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "app_zip"  {
      ~ id                  = "****************************************" -> (known after apply)
      ~ output_base64sha256 = "CLIecUHXBm4hr3cFUrklfEt6AWaJj8S1LuoZ63p0lQ0=" -> (known after apply)
      ~ output_md5          = "88ae6fe77d3f3826f32ae2f80e2148a3" -> (known after apply)
      ~ output_sha          = "0c13fdaa9be0ee57f5141dab24a9feeeac501493" -> (known after apply)
      ~ output_size         = 430802110 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.broker_eks.data.cloudfoundry_domain.apps will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_domain" "apps"  {
      ~ domain     = "cloud.gov" -> (known after apply)
      ~ id         = "************************************" -> (known after apply)
      ~ internal   = false -> (known after apply)
      ~ name       = "app.cloud.gov" -> (known after apply)
      + org        = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.broker_eks.data.cloudfoundry_service.rds will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_service" "rds"  {
      ~ id                  = "************************************" -> (known after apply)
        name                = "aws-rds"
      ~ service_broker_name = "aws-broker" -> (known after apply)
      ~ service_plans       = {
          - "large-gp-mysql"            = "399ebbb8-ab37-4883-bb7b-0467e66aa8f0"
          - "large-gp-mysql-redundant"  = "3cfd191c-809a-40b1-93c7-37f2f07ec151"
          - "large-gp-psql"             = "639ae8c5-7605-476d-ae55-cfc58f46c6d7"
          - "large-gp-psql-redundant"   = "7eab29c9-e690-4c98-9f78-07cde05b2904"
          - "medium-gp-mysql"           = "f2d7b4af-16e5-4504-8cf9-c1be5d3c81bc"
          - "medium-gp-mysql-redundant" = "f6e176ec-d093-42f7-80e8-2bbacbab450d"
          - "medium-gp-psql"            = "815c6069-289a-4444-ba99-40f0fa03a8f5"
          - "medium-gp-psql-redundant"  = "c1ddc2d6-983b-4ced-9995-064d9dde07aa"
          - "medium-mysql"              = "adf004d9-54b6-40e8-ae6a-56ee985a646c"
          - "medium-mysql-redundant"    = "8bfe6ea3-d8b1-4495-8b4c-5aba9c529f4c"
          - "medium-oracle-se2"         = "601b6c2b-2bac-42a0-84c4-4cb841c34deb"
          - "medium-psql"               = "d8af8c96-8cfd-455f-8660-35a029fec110"
          - "medium-psql-redundant"     = "2fb989d0-4097-4726-9877-88c44fa7a622"
          - "micro-psql"                = "5ed9f319-4c75-4851-9885-598a96b7febc"
          - "micro-psql-redundant"      = "ad7461b3-cb73-4859-a660-477993f85f6f"
          - "shared-mysql"              = "3a8e624f-ba5a-4435-8fa4-ee955b103bae"
          - "shared-psql"               = "64a259ed-01ab-4cdb-ace3-14fc7bde4ab6"
          - "small-mysql"               = "88663dbc-92c9-4b40-9f07-fb4788436fc5"
          - "small-mysql-redundant"     = "4b9e5bb1-d0d3-4c24-8542-e377cbb85aed"
          - "small-psql"                = "903c65ce-6c2b-420f-ad7d-a94ac4d52e93"
          - "small-psql-redundant"      = "731eb930-81ea-4a03-82f2-a187d8339d14"
          - "xlarge-gp-mysql"           = "1f44135c-64a8-44fc-bc61-539f126cdb78"
          - "xlarge-gp-mysql-redundant" = "2ed298b8-a7b5-400a-b2f1-c8198423c861"
          - "xlarge-gp-psql"            = "0fd6a750-0860-4c48-a5ea-fdce04500e23"
          - "xlarge-gp-psql-redundant"  = "58b899e8-eb36-441f-b406-d2f5b1e49c00"
        } -> (known after apply)
    }

  # module.broker_eks.data.cloudfoundry_space.broker_space will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_space" "broker_space"  {
      - annotations = {} -> null
      ~ id          = "************************************" -> (known after apply)
      - labels      = {} -> null
        name        = "management-staging"
      ~ org         = "90047c5d-337f-4802-bd48-2149a4265040" -> (known after apply)
      + quota       = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.broker_eks.data.cloudfoundry_space.spaces["gsa-datagov/management-staging"] will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_space" "spaces"  {
      - annotations = {} -> null
      ~ id          = "************************************" -> (known after apply)
      - labels      = {} -> null
        name        = "management-staging"
      ~ org         = "90047c5d-337f-4802-bd48-2149a4265040" -> (known after apply)
      + quota       = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.broker_eks.cloudfoundry_app.ssb must be replaced
-/+ resource "cloudfoundry_app" "ssb" {
      ~ enable_ssh                 = true -> false
      ~ environment                = (sensitive value)
      + health_check_http_endpoint = (known after apply)
      ~ health_check_timeout       = 0 -> (known after apply)
      ~ id                         = "************************************" -> (known after apply)
      ~ id_bg                      = "************************************" -> (known after apply)
        name                       = "ssb-eks"
      ~ ports                      = [
          - 8080,
        ] -> (known after apply)
      ~ source_code_hash           = "CLIecUHXBm4hr3cFUrklfEt6AWaJj8S1LuoZ63p0lQ0=" -> (known after apply)
      ~ space                      = "5edc803e-3376-4788-b72c-a152f11925b0" -> (known after apply) # forces replacement
      ~ stack                      = "ad34309f-ab24-4c3d-9ad1-eb0da8378bd4" -> (known after apply)
        # (10 unchanged attributes hidden)

      - routes {
          - port  = 8080 -> null
          - route = "9e8c7bd3-b996-4723-a8dc-0d23399715e9" -> null
        }
      + routes {
          + port  = (known after apply)
          + route = (known after apply)
        }

      ~ service_binding {
          - params           = (sensitive value)
          ~ service_instance = "59e8f0e3-c5aa-4b3c-9c8e-672c5805feae" -> (known after apply)
        }
    }

  # module.broker_eks.cloudfoundry_route.ssb_uri must be replaced
-/+ resource "cloudfoundry_route" "ssb_uri" {
      ~ domain   = "50ba3f69-cd54-4963-9172-14f3334b479e" -> (known after apply) # forces replacement
      ~ endpoint = "ssb-eks-gsa-datagov-management-staging.app.cloud.gov" -> (known after apply)
      ~ id       = "************************************" -> (known after apply)
      + port     = (known after apply)
      ~ space    = "5edc803e-3376-4788-b72c-a152f11925b0" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.broker_eks.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/management-staging"] must be replaced
-/+ resource "cloudfoundry_service_broker" "space_scoped_broker" {
      ~ catalog_hash                     = "jAV_jEp-8QsKnQDfps-yPPwOoKw=" -> (known after apply)
      ~ id                               = "************************************" -> (known after apply)
        name                             = "ssb-eks-gsa-datagov-management-staging"
      ~ service_plans                    = {
          - "aws-eks-service/raw" = "36000c96-9efc-4143-97aa-6f1cfbe9a7ba"
        } -> (known after apply)
      ~ services                         = {
          - "aws-eks-service" = "43c8e6b8-1cf6-4d4a-9ad9-d227fd7d00ca"
        } -> (known after apply)
      ~ space                            = "5edc803e-3376-4788-b72c-a152f11925b0" -> (known after apply) # forces replacement
      ~ url                              = "https://ssb-eks-gsa-datagov-management-staging.app.cloud.gov" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.broker_eks.cloudfoundry_service_instance.db must be replaced
-/+ resource "cloudfoundry_service_instance" "db" {
      ~ id                             = "************************************" -> (known after apply)
        name                           = "ssb-eks-db"
      ~ service_plan                   = "3a8e624f-ba5a-4435-8fa4-ee955b103bae" -> (known after apply)
      ~ space                          = "5edc803e-3376-4788-b72c-a152f11925b0" -> (known after apply) # forces replacement
        tags                           = [
            "mysql",
        ]
        # (3 unchanged attributes hidden)
    }

Plan: 9 to add, 1 to change, 9 to destroy.

Changes to Outputs:
  ~ route53_zone_nameservers = [
      - [
          - "ns-1148.awsdns-15.org",
          - "ns-1937.awsdns-50.co.uk",
          - "ns-377.awsdns-47.com",
          - "ns-965.awsdns-56.net",
        ],
      + (known after apply),
    ]
```
</details>

Plan generated in [plan #58](https://github.com/GSA/datagov-ssb/actions/runs/743389137)